import { Button } from "@mui/material";
import React, { useEffect } from "react";
import { Link } from "react-router-dom";

function Faq() {
  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);
  return (
    <div className="mt-[100px] p-10">
      <section className=" text-[#fff] h-[570px]">
        <h2>Часті запитання </h2>

        <h3>1. Як здійснюється доставка товару?</h3>
        <p>
          Доставка товарів здійснюється через службу Нова Пошта. Ви можете
          обрати відділення або кур'єрську доставку під час оформлення
          замовлення. Зазвичай доставка займає 1-3 робочі дні.
        </p>

        <h3>2. Як можна оплатити замовлення?</h3>
        <p>
          Оплата здійснюється при отриманні товару на відділенні Нової Пошти. Ви
          маєте можливість оглянути товар перед оплатою.
        </p>

        <h3>3. Чи можна повернути товар?</h3>
        <p>
          Так, ви можете повернути товар протягом 14 днів з моменту отримання за
          умови, що він не використовувався і збережено товарний вигляд та
          упаковку.
        </p>

        <h3>4. Чи є гарантія на товари?</h3>
        <p>
          Так, всі товари в нашому магазині мають гарантію, термін якої залежить
          від конкретного виробу. Ви можете дізнатися більше про гарантію на
          сторінці товару або звернувшись до нашої служби підтримки.
        </p>

        <h3>5. Як можна зв'язатися з вами?</h3>
        <p>
          Ви можете зв'язатися з нами через соціальні мережі (Facebook,
          Instagram, Telegram) або за телефоном, вказаним на нашому сайті. Ми
          завжди раді допомогти!
        </p>

        <Link to="/">
          <Button
            variant="contained"
            color="primary"
            sx={{
              backgroundColor: "#f28a0a",
              margin: "0 auto",
              "&:hover": {
                backgroundColor: "rgba(242, 138, 10, 0.7)",
              },
            }}
          >
            На головну
          </Button>
        </Link>
      </section>
    </div>
  );
}

export default Faq;
