import { Button } from "@mui/material";
import React, { useEffect } from "react";
import { Link } from "react-router-dom";

function AboutUs() {
  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);
  return (
    <div className="mt-[100px] p-10">
      <section className=" text-[#fff] h-[500px]">
        <h2>Про нас</h2>

        <p>
          Ласкаво просимо до "128auto" — вашого надійного партнера у світі
          автомобільних товарів. Ми працюємо з 2018 року, постійно розширюючи
          асортимент і вдосконалюючи сервіс, щоб кожен водій знайшов саме те, що
          йому потрібно для свого автомобіля.
        </p>

        <p>
          З самого початку наша мета — забезпечити кожного клієнта якісними та
          надійними автотоварами. У нашому магазині ви знайдете великий вибір
          продукції, включаючи авто хімію, автопилососи, компресори, набори для
          обслуговування та багато іншого. Ми працюємо лише з перевіреними
          брендами, щоб гарантувати високу якість кожного товару.
        </p>

        <p>
          "128auto" прагне бути не просто магазином, а надійним помічником для
          кожного автомобіліста. Ми пишаємося тим, що наша команда з 2018 року
          допомагає клієнтам у виборі кращих рішень для догляду за автомобілями,
          забезпечуючи безпеку та комфорт на дорозі.
        </p>

        <Link to="/">
          <Button
            variant="contained"
            color="primary"
            sx={{
              backgroundColor: "#f28a0a",
              margin: "0 auto",
              "&:hover": {
                backgroundColor: "rgba(242, 138, 10, 0.7)",
              },
            }}
          >
            На головну
          </Button>
        </Link>
      </section>
    </div>
  );
}

export default AboutUs;
